{"config": [{"config": {"activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 24], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "units": 12, "name": "dense_1", "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "units": 6, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}